Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/timer_b.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/
//*****************************************************************************
//
// timer_b.c - Driver for the timer_b Module.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup timer_b_api
//! @{
//
//*****************************************************************************

#include "inc/hw_regaccess.h"
#include "inc/hw_memmap.h"

#ifdef __MSP430_HAS_TxB7__
#include "timer_b.h"

#include <assert.h>

//*****************************************************************************
//
//! \brief Starts TIMER_B counter
//!
//! This function assumes that the timer has been previously configured using
//! TIMER_B_configureContinuousMode, TIMER_B_configureUpMode or
//! TIMER_B_configureUpDownMode.
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param timerMode selects the mode of the timer
//!        Valid values are:
//!        - \b TIMER_B_STOP_MODE
//!        - \b TIMER_B_UP_MODE
//!        - \b TIMER_B_CONTINUOUS_MODE [Default]
//!        - \b TIMER_B_UPDOWN_MODE
//!
//! Modified bits of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_startCounter( uint16_t baseAddress,
                           uint16_t timerMode
                           )
{
        assert(
                (TIMER_B_UPDOWN_MODE == timerMode) ||
                (TIMER_B_CONTINUOUS_MODE == timerMode) ||
                (TIMER_B_UP_MODE == timerMode)
                );

        HWREG16(baseAddress + OFS_TBxCTL) |= timerMode;
}

//*****************************************************************************
//
//! \brief Configures TIMER_B in continuous mode.
//!
//! This API does not start the timer. Timer needs to be started when required
//! using the TIMER_B_startCounter API.
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param param is the pointer to struct for continuous mode initialization.
//!
//! Modified bits of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_initContinuousMode(uint16_t baseAddress,
                                TIMER_B_initContinuousModeParam *param)
{
        assert(param != 0);

        assert(
                (TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK == param->clockSource) ||
                (TIMER_B_CLOCKSOURCE_ACLK == param->clockSource) ||
                (TIMER_B_CLOCKSOURCE_SMCLK == param->clockSource) ||
                (TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == param->clockSource)
                );

        assert(
                (TIMER_B_DO_CLEAR == param->timerClear) ||
                (TIMER_B_SKIP_CLEAR == param->timerClear)
                );

        assert(
                (TIMER_B_TBIE_INTERRUPT_ENABLE == param->timerInterruptEnable_TBIE) ||
                (TIMER_B_TBIE_INTERRUPT_DISABLE == param->timerInterruptEnable_TBIE)
                );

        assert(
                (TIMER_B_CLOCKSOURCE_DIVIDER_1 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_2 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_4 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_8 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_3 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_5 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_6 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_7 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_10 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_12 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_14 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_16 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_20 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_24 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_28 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_32 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_40 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_48 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_56 == param->clockSourceDivider) ||
                (TIMER_B_CLOCKSOURCE_DIVIDER_64 == param->clockSourceDivider)
                );

        HWREG16(baseAddress +
                OFS_TBxCTL) &= ~(TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
                                 TIMER_B_UPDOWN_MODE +
                                 TIMER_B_DO_CLEAR +
                                 TIMER_B_TBIE_INTERRUPT_ENABLE +
                                 CNTL_3 +
                                 ID__8
                                 );
        HWREG16(baseAddress + OFS_TBxEX0) &= ~TBIDEX_7;

