Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/timer_b.c
        HWREG16(baseAddress + OFS_TBxEX0) |= param->clockSourceDivider & 0x7;

        HWREG16(baseAddress + OFS_TBxCTL) |= (param->clockSource +
                                              param->timerClear +
                                              param->timerInterruptEnable_TBIE +
                                              ((param->clockSourceDivider >> 3) << 6));

        if (param->startTimer)
                HWREG16(baseAddress + OFS_TBxCTL) |= TIMER_B_CONTINUOUS_MODE;
}

//*****************************************************************************
//
//! \brief DEPRECATED - Configures TIMER_B in continuous mode.
//!
//! This API does not start the timer. Timer needs to be started when required
//! using the TIMER_B_startCounter API.
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param clockSource selects the clock source
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK [Default]
//!        - \b TIMER_B_CLOCKSOURCE_ACLK
//!        - \b TIMER_B_CLOCKSOURCE_SMCLK
//!        - \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source.
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_1 [Default]
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerInterruptEnable_TBIE is to enable or disable TIMER_B interrupt
//!        Valid values are:
//!        - \b TIMER_B_TBIE_INTERRUPT_ENABLE
//!        - \b TIMER_B_TBIE_INTERRUPT_DISABLE [Default]
//! \param timerClear decides if TIMER_B clock divider, count direction, count
//!        need to be reset.
//!        Valid values are:
//!        - \b TIMER_B_DO_CLEAR
//!        - \b TIMER_B_SKIP_CLEAR [Default]
//!
//! Modified bits of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_configureContinuousMode( uint16_t baseAddress,
                                      uint16_t clockSource,
                                      uint16_t clockSourceDivider,
                                      uint16_t timerInterruptEnable_TBIE,
                                      uint16_t timerClear
                                      )
{
        TIMER_B_initContinuousModeParam param = { 0 };

        param.clockSource = clockSource;
        param.clockSourceDivider = clockSourceDivider;
        param.timerInterruptEnable_TBIE = timerInterruptEnable_TBIE;
        param.timerClear = timerClear;
        param.startTimer = false;

        TIMER_B_initContinuousMode(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Configures TIMER_B in up mode.
//!
//! This API does not start the timer. Timer needs to be started when required
//! using the TIMER_B_startCounter API.
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param param is the pointer to struct for up mode initialization.
//!
//! Modified bits of \b TBxCTL register, bits of \b TBxCCTL0 register and bits
//! of \b TBxCCR0 register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_initUpMode(uint16_t baseAddress,
                        TIMER_B_initUpModeParam *param)
{
        assert(param != 0);

        assert(
                (TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK == param->clockSource) ||
                (TIMER_B_CLOCKSOURCE_ACLK == param->clockSource) ||
                (TIMER_B_CLOCKSOURCE_SMCLK == param->clockSource) ||
                (TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == param->clockSource)
                );

        assert(
                (TIMER_B_DO_CLEAR == param->timerClear) ||
                (TIMER_B_SKIP_CLEAR == param->timerClear)
                );

        assert(
                (TIMER_B_DO_CLEAR == param->timerClear) ||
                (TIMER_B_SKIP_CLEAR == param->timerClear)
                );

        HWREG16(baseAddress + OFS_TBxCTL) &=
                ~(TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
                  TIMER_B_UPDOWN_MODE +
                  TIMER_B_DO_CLEAR +
                  TIMER_B_TBIE_INTERRUPT_ENABLE +
                  CNTL_3
                  );
        HWREG16(baseAddress + OFS_TBxEX0) &= ~TBIDEX_7;

        HWREG16(baseAddress + OFS_TBxEX0) |= param->clockSourceDivider & 0x7;

        HWREG16(baseAddress + OFS_TBxCTL) |= (param->clockSource +
                                              param->timerClear +
                                              param->timerInterruptEnable_TBIE +
                                              ((param->clockSourceDivider >> 3) << 6));

        if (param->startTimer)
                HWREG16(baseAddress + OFS_TBxCTL) |= TIMER_B_UP_MODE;

        if (TIMER_B_CCIE_CCR0_INTERRUPT_ENABLE ==
            param->captureCompareInterruptEnable_CCR0_CCIE)
                HWREG16(baseAddress + OFS_TBxCCTL0)  |= TIMER_B_CCIE_CCR0_INTERRUPT_ENABLE;
        else
                HWREG16(baseAddress + OFS_TBxCCTL0)  &= ~TIMER_B_CCIE_CCR0_INTERRUPT_ENABLE;

