Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/timer_b.c
        TIMER_B_initContinuousMode(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief DEPRECATED - Spelling Error Fixed. Starts TIMER_B in continuous
//! mode.
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param clockSource selects the clock source
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK [Default]
//!        - \b TIMER_B_CLOCKSOURCE_ACLK
//!        - \b TIMER_B_CLOCKSOURCE_SMCLK
//!        - \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source.
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_1 [Default]
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerInterruptEnable_TBIE is to enable or disable TIMER_B interrupt
//!        Valid values are:
//!        - \b TIMER_B_TBIE_INTERRUPT_ENABLE
//!        - \b TIMER_B_TBIE_INTERRUPT_DISABLE [Default]
//! \param timerClear decides if TIMER_B clock divider, count direction, count
//!        need to be reset.
//!        Valid values are:
//!        - \b TIMER_B_DO_CLEAR
//!        - \b TIMER_B_SKIP_CLEAR [Default]
//!
//! Modified bits of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_startContinousMode( uint16_t baseAddress,
                                 uint16_t clockSource,
                                 uint16_t clockSourceDivider,
                                 uint16_t timerInterruptEnable_TBIE,
                                 uint16_t timerClear
                                 )
{
        TIMER_B_startContinuousMode(baseAddress,
                                    clockSource,
                                    clockSourceDivider,
                                    timerInterruptEnable_TBIE,
                                    timerClear
                                    );
}

//*****************************************************************************
//
//! \brief DEPRECATED - Replaced by TIMER_B_configureUpMode and
//! TIMER_B_startCounter API. Starts TIMER_B in up mode.
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param clockSource selects the clock source
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK [Default]
//!        - \b TIMER_B_CLOCKSOURCE_ACLK
//!        - \b TIMER_B_CLOCKSOURCE_SMCLK
//!        - \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source.
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_1 [Default]
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerPeriod is the specified TIMER_B period. This is the value that
//!        gets written into the CCR0. Limited to 16 bits[uint16_t]
//! \param timerInterruptEnable_TBIE is to enable or disable TIMER_B interrupt
//!        Valid values are:
//!        - \b TIMER_B_TBIE_INTERRUPT_ENABLE
//!        - \b TIMER_B_TBIE_INTERRUPT_DISABLE [Default]
//! \param captureCompareInterruptEnable_CCR0_CCIE is to enable or disable
//!        TIMER_B CCR0 capture compare interrupt.
//!        Valid values are:
//!        - \b TIMER_B_CCIE_CCR0_INTERRUPT_ENABLE
//!        - \b TIMER_B_CCIE_CCR0_INTERRUPT_DISABLE [Default]
//! \param timerClear decides if TIMER_B clock divider, count direction, count
//!        need to be reset.
//!        Valid values are:
//!        - \b TIMER_B_DO_CLEAR
//!        - \b TIMER_B_SKIP_CLEAR [Default]
//!
//! Modified bits of \b TBxCTL register, bits of \b TBxCCTL0 register and bits
//! of \b TBxCCR0 register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_startUpMode(   uint16_t baseAddress,
                            uint16_t clockSource,
                            uint16_t clockSourceDivider,
                            uint16_t timerPeriod,
                            uint16_t timerInterruptEnable_TBIE,
                            uint16_t captureCompareInterruptEnable_CCR0_CCIE,
                            uint16_t timerClear
                            )
{
        TIMER_B_initUpModeParam param = { 0 };

        param.clockSource = clockSource;
        param.clockSourceDivider = clockSourceDivider;
        param.timerPeriod = timerPeriod;
        param.timerInterruptEnable_TBIE = timerInterruptEnable_TBIE;
        param.captureCompareInterruptEnable_CCR0_CCIE =
                captureCompareInterruptEnable_CCR0_CCIE;
        param.timerClear = timerClear;
        param.startTimer = true;

