Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/timer_b.c
        TIMER_B_initUpMode(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief DEPRECATED - Replaced by TIMER_B_configureUpDownMode and
//! TIMER_B_startCounter API. Starts TIMER_B in up down mode.
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param clockSource selects the clock source
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK [Default]
//!        - \b TIMER_B_CLOCKSOURCE_ACLK
//!        - \b TIMER_B_CLOCKSOURCE_SMCLK
//!        - \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source.
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_1 [Default]
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerPeriod is the specified TIMER_B period
//! \param timerInterruptEnable_TBIE is to enable or disable TIMER_B interrupt
//!        Valid values are:
//!        - \b TIMER_B_TBIE_INTERRUPT_ENABLE
//!        - \b TIMER_B_TBIE_INTERRUPT_DISABLE [Default]
//! \param captureCompareInterruptEnable_CCR0_CCIE is to enable or disable
//!        TIMER_B CCR0 capture compare interrupt.
//!        Valid values are:
//!        - \b TIMER_B_CCIE_CCR0_INTERRUPT_ENABLE
//!        - \b TIMER_B_CCIE_CCR0_INTERRUPT_DISABLE [Default]
//! \param timerClear decides if TIMER_B clock divider, count direction, count
//!        need to be reset.
//!        Valid values are:
//!        - \b TIMER_B_DO_CLEAR
//!        - \b TIMER_B_SKIP_CLEAR [Default]
//!
//! Modified bits of \b TBxCTL register, bits of \b TBxCCTL0 register and bits
//! of \b TBxCCR0 register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_startUpDownMode(
        uint16_t baseAddress,
        uint16_t clockSource,
        uint16_t clockSourceDivider,
        uint16_t timerPeriod,
        uint16_t timerInterruptEnable_TBIE,
        uint16_t captureCompareInterruptEnable_CCR0_CCIE,
        uint16_t timerClear
        )
{
        TIMER_B_initUpDownModeParam param = { 0 };

        param.clockSource = clockSource;
        param.clockSourceDivider = clockSourceDivider;
        param.timerPeriod = timerPeriod;
        param.timerInterruptEnable_TBIE = timerInterruptEnable_TBIE;
        param.captureCompareInterruptEnable_CCR0_CCIE =
                captureCompareInterruptEnable_CCR0_CCIE;
        param.timerClear = timerClear;
        param.startTimer = true;

        TIMER_B_initUpDownMode(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes Capture Mode
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param param is the pointer to struct for capture mode initialization.
//!
//! Modified bits of \b TBxCCTLn register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_initCaptureMode(uint16_t baseAddress,
                             TIMER_B_initCaptureModeParam *param)
{
        assert(param != 0);

        assert((TIMER_B_CAPTURECOMPARE_REGISTER_0 == param->captureRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_1 == param->captureRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_2 == param->captureRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_3 == param->captureRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_4 == param->captureRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_5 == param->captureRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_6 == param->captureRegister)
               );

        assert((TIMER_B_CAPTUREMODE_NO_CAPTURE == param->captureMode) ||
               (TIMER_B_CAPTUREMODE_RISING_EDGE == param->captureMode) ||
               (TIMER_B_CAPTUREMODE_FALLING_EDGE == param->captureMode) ||
               (TIMER_B_CAPTUREMODE_RISING_AND_FALLING_EDGE == param->captureMode)
               );

        assert((TIMER_B_CAPTURE_INPUTSELECT_CCIxA == param->captureInputSelect) ||
               (TIMER_B_CAPTURE_INPUTSELECT_CCIxB == param->captureInputSelect) ||
               (TIMER_B_CAPTURE_INPUTSELECT_GND == param->captureInputSelect) ||
               (TIMER_B_CAPTURE_INPUTSELECT_Vcc == param->captureInputSelect)
               );

        assert((TIMER_B_CAPTURE_ASYNCHRONOUS == param->synchronizeCaptureSource) ||
               (TIMER_B_CAPTURE_SYNCHRONOUS == param->synchronizeCaptureSource)
               );

        assert(
                (TIMER_B_CAPTURECOMPARE_INTERRUPT_DISABLE == param->captureInterruptEnable) ||
                (TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE == param->captureInterruptEnable)
                );

        assert((TIMER_B_OUTPUTMODE_OUTBITVALUE == param->captureOutputMode) ||
               (TIMER_B_OUTPUTMODE_SET == param->captureOutputMode) ||
               (TIMER_B_OUTPUTMODE_TOGGLE_RESET == param->captureOutputMode) ||
               (TIMER_B_OUTPUTMODE_SET_RESET == param->captureOutputMode) ||
               (TIMER_B_OUTPUTMODE_TOGGLE == param->captureOutputMode) ||
               (TIMER_B_OUTPUTMODE_RESET == param->captureOutputMode) ||
               (TIMER_B_OUTPUTMODE_TOGGLE_SET == param->captureOutputMode) ||
               (TIMER_B_OUTPUTMODE_RESET_SET == param->captureOutputMode)
               );

        //CaptureCompare register 0 only supports certain modes
        assert((TIMER_B_CAPTURECOMPARE_REGISTER_0 == param->captureRegister) &&
               ((TIMER_B_OUTPUTMODE_OUTBITVALUE == param->captureOutputMode) ||
                (TIMER_B_OUTPUTMODE_SET == param->captureOutputMode) ||
                (TIMER_B_OUTPUTMODE_TOGGLE == param->captureOutputMode) ||
                (TIMER_B_OUTPUTMODE_RESET == param->captureOutputMode)));

