Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/timer_b.c
        HWREG16(baseAddress + param->captureRegister ) |= CAP;

        HWREG16(baseAddress + param->captureRegister) &=
                ~(TIMER_B_CAPTUREMODE_RISING_AND_FALLING_EDGE +
                  TIMER_B_CAPTURE_INPUTSELECT_Vcc +
                  TIMER_B_CAPTURE_SYNCHRONOUS +
                  TIMER_B_DO_CLEAR +
                  TIMER_B_TBIE_INTERRUPT_ENABLE +
                  CM_3
                  );

        HWREG16(baseAddress + param->captureRegister) |= (param->captureMode +
                                                          param->captureInputSelect +
                                                          param->synchronizeCaptureSource +
                                                          param->captureInterruptEnable +
                                                          param->captureOutputMode
                                                          );
}

//*****************************************************************************
//
//! \brief DEPRECATED - Initializes Capture Mode
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param captureRegister selects the capture register being used. Refer to
//!        datasheet to ensure the device has the capture register being used.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//! \param captureMode is the capture mode selected.
//!        Valid values are:
//!        - \b TIMER_B_CAPTUREMODE_NO_CAPTURE [Default]
//!        - \b TIMER_B_CAPTUREMODE_RISING_EDGE
//!        - \b TIMER_B_CAPTUREMODE_FALLING_EDGE
//!        - \b TIMER_B_CAPTUREMODE_RISING_AND_FALLING_EDGE
//! \param captureInputSelect decides the Input Select
//!        Valid values are:
//!        - \b TIMER_B_CAPTURE_INPUTSELECT_CCIxA [Default]
//!        - \b TIMER_B_CAPTURE_INPUTSELECT_CCIxB
//!        - \b TIMER_B_CAPTURE_INPUTSELECT_GND
//!        - \b TIMER_B_CAPTURE_INPUTSELECT_Vcc
//! \param synchronizeCaptureSource decides if capture source should be
//!        synchronized with TIMER_B clock
//!        Valid values are:
//!        - \b TIMER_B_CAPTURE_ASYNCHRONOUS [Default]
//!        - \b TIMER_B_CAPTURE_SYNCHRONOUS
//! \param captureInterruptEnable is to enable or disable TIMER_B capture
//!        compare interrupt.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_INTERRUPT_DISABLE [Default]
//!        - \b TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE
//! \param captureOutputMode specifies the output mode.
//!        Valid values are:
//!        - \b TIMER_B_OUTPUTMODE_OUTBITVALUE [Default]
//!        - \b TIMER_B_OUTPUTMODE_SET
//!        - \b TIMER_B_OUTPUTMODE_TOGGLE_RESET
//!        - \b TIMER_B_OUTPUTMODE_SET_RESET
//!        - \b TIMER_B_OUTPUTMODE_TOGGLE
//!        - \b TIMER_B_OUTPUTMODE_RESET
//!        - \b TIMER_B_OUTPUTMODE_TOGGLE_SET
//!        - \b TIMER_B_OUTPUTMODE_RESET_SET
//!
//! Modified bits of \b TBxCCTLn register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_initCapture(uint16_t baseAddress,
                         uint16_t captureRegister,
                         uint16_t captureMode,
                         uint16_t captureInputSelect,
                         uint16_t synchronizeCaptureSource,
                         uint16_t captureInterruptEnable,
                         uint16_t captureOutputMode
                         )
{
        TIMER_B_initCaptureModeParam param = { 0 };

        param.captureRegister = captureRegister;
        param.captureMode = captureMode;
        param.captureInputSelect = captureInputSelect;
        param.synchronizeCaptureSource = synchronizeCaptureSource;
        param.captureInterruptEnable = captureInterruptEnable;
        param.captureOutputMode = captureOutputMode;

        TIMER_B_initCaptureMode(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Initializes Compare Mode
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param param is the pointer to struct for compare mode initialization.
//!
//! Modified bits of \b TBxCCTLn register and bits of \b TBxCCRn register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_initCompareMode(uint16_t baseAddress,
                             TIMER_B_initCompareModeParam *param)
{
        assert(param != 0);

        assert((TIMER_B_CAPTURECOMPARE_REGISTER_0 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_1 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_2 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_3 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_4 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_5 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_6 == param->compareRegister)
               );

        assert((TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE == param->compareInterruptEnable) ||
               (TIMER_B_CAPTURECOMPARE_INTERRUPT_DISABLE == param->compareInterruptEnable)
               );

        assert((TIMER_B_OUTPUTMODE_OUTBITVALUE == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_SET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_TOGGLE_RESET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_SET_RESET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_TOGGLE == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_RESET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_TOGGLE_SET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_RESET_SET == param->compareOutputMode)
               );

        //CaptureCompare register 0 only supports certain modes
        assert((TIMER_B_CAPTURECOMPARE_REGISTER_0 == param->compareRegister) &&
               ((TIMER_B_OUTPUTMODE_OUTBITVALUE == param->compareOutputMode) ||
                (TIMER_B_OUTPUTMODE_SET == param->compareOutputMode) ||
                (TIMER_B_OUTPUTMODE_TOGGLE == param->compareOutputMode) ||
                (TIMER_B_OUTPUTMODE_RESET == param->compareOutputMode)));

        HWREG16(baseAddress + param->compareRegister ) &= ~CAP;

        HWREG16(baseAddress + param->compareRegister) &=
                ~(TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE +
                  TIMER_B_OUTPUTMODE_RESET_SET
                  );

        HWREG16(baseAddress + param->compareRegister) |= (param->compareInterruptEnable +
                                                          param->compareOutputMode
                                                          );

