Andrew-tesler/CecToUsb/CEC/driverlib/MSP430F5xx_6xx/timer_b.c
        return HWREG16(baseAddress + OFS_TBxR + captureCompareRegister);
}

//*****************************************************************************
//
//! \brief Set output bit for output mode
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param captureCompareRegister selects the capture compare register being
//!        used. Refer to datasheet to ensure the device has the capture
//!        compare register being used.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//! \param outputModeOutBitValue the value to be set for out bit
//!        Valid values are:
//!        - \b TIMER_B_OUTPUTMODE_OUTBITVALUE_HIGH
//!        - \b TIMER_B_OUTPUTMODE_OUTBITVALUE_LOW
//!
//! Modified bits of \b TBxCCTLn register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_setOutputForOutputModeOutBitValue
        (uint16_t baseAddress,
        uint16_t captureCompareRegister,
        uint8_t outputModeOutBitValue
        )
{
        assert((TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
               );

        assert((TIMER_B_OUTPUTMODE_OUTBITVALUE_HIGH == outputModeOutBitValue) ||
               (TIMER_B_OUTPUTMODE_OUTBITVALUE_LOW == outputModeOutBitValue)
               );

        HWREG16(baseAddress + captureCompareRegister) &= ~OUT;
        HWREG16(baseAddress + captureCompareRegister) |= outputModeOutBitValue;
}

//*****************************************************************************
//
//! \brief Generate a PWM with TIMER_B running in up mode
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param param is the pointer to struct for PWM configuration.
//!
//! Modified bits of \b TBxCCTLn register, bits of \b TBxCTL register, bits of
//! \b TBxCCTL0 register and bits of \b TBxCCR0 register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_outputPWM(uint16_t baseAddress, TIMER_B_outputPWMParam *param)
{
        assert(param != 0);

        assert(
                (TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK == param->clockSource) ||
                (TIMER_B_CLOCKSOURCE_ACLK == param->clockSource) ||
                (TIMER_B_CLOCKSOURCE_SMCLK == param->clockSource) ||
                (TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK == param->clockSource)
                );

        assert((TIMER_B_CAPTURECOMPARE_REGISTER_0 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_1 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_2 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_3 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_4 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_5 == param->compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_6 == param->compareRegister)
               );

        assert((TIMER_B_OUTPUTMODE_OUTBITVALUE == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_SET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_TOGGLE_RESET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_SET_RESET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_TOGGLE == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_RESET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_TOGGLE_SET == param->compareOutputMode) ||
               (TIMER_B_OUTPUTMODE_RESET_SET == param->compareOutputMode)
               );

        HWREG16(baseAddress + OFS_TBxCTL)  &=
                ~( TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK +
                   TIMER_B_UPDOWN_MODE + TIMER_B_DO_CLEAR +
                   TIMER_B_TBIE_INTERRUPT_ENABLE
                   );
        HWREG16(baseAddress + OFS_TBxEX0) &= ~TBIDEX_7;

        HWREG16(baseAddress + OFS_TBxEX0) |= param->clockSourceDivider & 0x7;

        HWREG16(baseAddress + OFS_TBxCTL) |= (param->clockSource +
                                              TIMER_B_UP_MODE +
                                              TIMER_B_DO_CLEAR +
                                              ((param->clockSourceDivider >> 3) << 6));

        HWREG16(baseAddress + OFS_TBxCCR0) = param->timerPeriod;

        HWREG16(baseAddress + OFS_TBxCCTL0)  &=
                ~(TIMER_B_CAPTURECOMPARE_INTERRUPT_ENABLE +
                  TIMER_B_OUTPUTMODE_RESET_SET
                  );

        HWREG16(baseAddress + param->compareRegister)  |= param->compareOutputMode;

        HWREG16(baseAddress + param->compareRegister + OFS_TBxR) = param->dutyCycle;
} //*****************************************************************************
//
//! \brief DEPRECATED - Generate a PWM with TIMER_B running in up mode
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param clockSource selects the clock source
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_EXTERNAL_TXCLK [Default]
//!        - \b TIMER_B_CLOCKSOURCE_ACLK
//!        - \b TIMER_B_CLOCKSOURCE_SMCLK
//!        - \b TIMER_B_CLOCKSOURCE_INVERTED_EXTERNAL_TXCLK
//! \param clockSourceDivider is the divider for Clock source.
//!        Valid values are:
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_1 [Default]
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_2
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_3
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_4
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_5
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_6
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_7
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_8
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_10
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_12
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_14
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_16
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_20
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_24
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_28
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_32
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_40
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_48
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_56
//!        - \b TIMER_B_CLOCKSOURCE_DIVIDER_64
//! \param timerPeriod selects the desired TIMER_B period
//! \param compareRegister selects the compare register being used. Refer to
//!        datasheet to ensure the device has the compare register being used.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//! \param compareOutputMode specifies the output mode.
//!        Valid values are:
//!        - \b TIMER_B_OUTPUTMODE_OUTBITVALUE [Default]
//!        - \b TIMER_B_OUTPUTMODE_SET
//!        - \b TIMER_B_OUTPUTMODE_TOGGLE_RESET
//!        - \b TIMER_B_OUTPUTMODE_SET_RESET
//!        - \b TIMER_B_OUTPUTMODE_TOGGLE
//!        - \b TIMER_B_OUTPUTMODE_RESET
//!        - \b TIMER_B_OUTPUTMODE_TOGGLE_SET
//!        - \b TIMER_B_OUTPUTMODE_RESET_SET
//! \param dutyCycle specifies the dutycycle for the generated waveform
//!
//! Modified bits of \b TBxCCTLn register, bits of \b TBxCTL register, bits of
//! \b TBxCCTL0 register and bits of \b TBxCCR0 register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_generatePWM(  uint16_t baseAddress,
                           uint16_t clockSource,
                           uint16_t clockSourceDivider,
                           uint16_t timerPeriod,
                           uint16_t compareRegister,
                           uint16_t compareOutputMode,
                           uint16_t dutyCycle
                           )
{
        TIMER_B_outputPWMParam param = { 0 };

        param.clockSource = clockSource;
        param.clockSourceDivider = clockSourceDivider;
        param.timerPeriod = timerPeriod;
        param.compareRegister = compareRegister;
        param.compareOutputMode = compareOutputMode;
        param.dutyCycle = dutyCycle;

        TIMER_B_outputPWM(baseAddress, &param);
}

//*****************************************************************************
//
//! \brief Stops the TIMER_B
//!
//! \param baseAddress is the base address of the TIMER_B module.
//!
//! Modified bits of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_stop( uint16_t baseAddress )
{
        HWREG16(baseAddress + OFS_TBxCTL)  &= ~MC_3;
        HWREG16(baseAddress + OFS_TBxCTL)  |= MC_0;
}

//*****************************************************************************
//
//! \brief Sets the value of the capture-compare register
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param compareRegister selects the compare register being used. Refer to
//!        datasheet to ensure the device has the compare register being used.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//! \param compareValue is the count to be compared with in compare mode
//!
//! Modified bits of \b TBxCCRn register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_setCompareValue(  uint16_t baseAddress,
                               uint16_t compareRegister,
                               uint16_t compareValue
                               )
{
        assert((TIMER_B_CAPTURECOMPARE_REGISTER_0 == compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_1 == compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_2 == compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_3 == compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_4 == compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_5 == compareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_6 == compareRegister)
               );

        HWREG16(baseAddress + compareRegister + OFS_TBxR) = compareValue;
}

//*****************************************************************************
//
//! \brief Clears the TIMER_B TBIFG interrupt flag
//!
//! \param baseAddress is the base address of the TIMER_B module.
//!
//! Modified bits are \b TBIFG of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_clearTimerInterruptFlag(uint16_t baseAddress)
{
        HWREG16(baseAddress + OFS_TBxCTL) &= ~TBIFG;
}

//*****************************************************************************
//
//! \brief Clears the capture-compare interrupt flag
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param captureCompareRegister selects the capture compare register being
//!        used. Refer to datasheet to ensure the device has the capture
//!        compare register being used.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//!
//! Modified bits are \b CCIFG of \b TBxCCTLn register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_clearCaptureCompareInterruptFlag(uint16_t baseAddress,
                                              uint16_t captureCompareRegister
                                              )
{
        assert((TIMER_B_CAPTURECOMPARE_REGISTER_0 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_1 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_2 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_3 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_4 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_5 == captureCompareRegister) ||
               (TIMER_B_CAPTURECOMPARE_REGISTER_6 == captureCompareRegister)
               );

        HWREG16(baseAddress + captureCompareRegister)  &= ~CCIFG;
}

//*****************************************************************************
//
//! \brief Selects TIMER_B counter length
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param counterLength selects the value of counter length.
//!        Valid values are:
//!        - \b TIMER_B_COUNTER_16BIT [Default]
//!        - \b TIMER_B_COUNTER_12BIT
//!        - \b TIMER_B_COUNTER_10BIT
//!        - \b TIMER_B_COUNTER_8BIT
//!
//! Modified bits are \b CNTL of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_selectCounterLength(uint16_t baseAddress,
                                 uint16_t counterLength
                                 )
{
        assert((TIMER_B_COUNTER_8BIT == counterLength) ||
               (TIMER_B_COUNTER_10BIT == counterLength) ||
               (TIMER_B_COUNTER_12BIT == counterLength) ||
               (TIMER_B_COUNTER_16BIT == counterLength)
               );

        HWREG16(baseAddress + OFS_TBxCTL) &= ~CNTL_3;
        HWREG16(baseAddress + OFS_TBxCTL) |= counterLength;
}

//*****************************************************************************
//
//! \brief Selects TIMER_B Latching Group
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param groupLatch selects the latching group.
//!        Valid values are:
//!        - \b TIMER_B_GROUP_NONE [Default]
//!        - \b TIMER_B_GROUP_CL12_CL23_CL56
//!        - \b TIMER_B_GROUP_CL123_CL456
//!        - \b TIMER_B_GROUP_ALL
//!
//! Modified bits are \b TBCLGRP of \b TBxCTL register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_selectLatchingGroup(uint16_t baseAddress,
                                 uint16_t groupLatch)
{
        assert((TIMER_B_GROUP_NONE  == groupLatch) ||
               (TIMER_B_GROUP_CL12_CL23_CL56 == groupLatch) ||
               (TIMER_B_GROUP_CL123_CL456 == groupLatch) ||
               (TIMER_B_GROUP_ALL == groupLatch)
               );

        HWREG16(baseAddress + OFS_TBxCTL) &= ~TBCLGRP_3;
        HWREG16(baseAddress + OFS_TBxCTL) |= groupLatch;
}

//*****************************************************************************
//
//! \brief Selects Compare Latch Load Event
//!
//! \param baseAddress is the base address of the TIMER_B module.
//! \param compareRegister selects the compare register being used. Refer to
//!        datasheet to ensure the device has the compare register being used.
//!        Valid values are:
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_0
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_1
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_2
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_3
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_4
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_5
//!        - \b TIMER_B_CAPTURECOMPARE_REGISTER_6
//! \param compareLatchLoadEvent selects the latch load event
//!        Valid values are:
//!        - \b TIMER_B_LATCH_ON_WRITE_TO_TBxCCRn_COMPARE_REGISTER [Default]
//!        - \b TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UP_OR_CONT_MODE
//!        - \b TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UPDOWN_MODE
//!        - \b
//!           TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_CURRENT_COMPARE_LATCH_VALUE
//!
//! Modified bits are \b CLLD of \b TBxCCTLn register.
//!
//! \return None
//
//*****************************************************************************
void TIMER_B_initCompareLatchLoadEvent(uint16_t baseAddress,
                                       uint16_t compareRegister,
                                       uint16_t compareLatchLoadEvent
                                       )
{
        assert((TIMER_B_LATCH_ON_WRITE_TO_TBxCCRn_COMPARE_REGISTER  == compareLatchLoadEvent) ||
               (TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UP_OR_CONT_MODE == compareLatchLoadEvent) ||
               (TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_0_IN_UPDOWN_MODE == compareLatchLoadEvent) ||
               (TIMER_B_LATCH_WHEN_COUNTER_COUNTS_TO_CURRENT_COMPARE_LATCH_VALUE == compareLatchLoadEvent)
               );

        HWREG16(baseAddress + compareRegister)  &= ~CLLD_3;
        HWREG16(baseAddress + compareRegister)  |= compareLatchLoadEvent;
}

//*****************************************************************************
//
//! \brief Reads the current timer count value
//!
//! Reads the current count value of the timer. There is a majority vote system
//! in place to confirm an accurate value is returned. The TIMER_B_THRESHOLD
//! #define in the associated header file can be modified so that the votes
//! must be closer together for a consensus to occur.
//!
//! \param baseAddress is the base address of the Timer module.
//!
//! \return Majority vote of timer count value
//
//*****************************************************************************
uint16_t TIMER_B_getCounterValue(uint16_t baseAddress)
{
        uint16_t voteOne, voteTwo, res;

        voteTwo = HWREG16(baseAddress + OFS_TBxR);

        do {
                voteOne = voteTwo;
                voteTwo = HWREG16(baseAddress + OFS_TBxR);

                if (voteTwo > voteOne)
                        res = voteTwo - voteOne;
                else if (voteOne > voteTwo)
                        res = voteOne - voteTwo;
                else
                        res = 0;

        } while ( res > TIMER_B_THRESHOLD);

        return voteTwo;
}


#endif
//*****************************************************************************
//
//! Close the doxygen group for timer_b_api
//! @}
//
//*****************************************************************************
